#include <stdio.h>
#include <math.h>

int main(void)
{
    /*При исп вещественного счетчика ошибка округления накапливаеться из-за урезания числа,
    чем меньше взято значащих символ теб больше будет погрешность, в float 6-7, поэтому double 10-13
    Если последняя точка X станет чуть больше из за округления, то она может не попасть в диапазон*/
    double A = 1.0,B = 10.0,H = 1.0;
    int k = 0;

    for (double X = A;X <= B;X+=H){
        double Y;
        Y = 1.0 / sqrt(X);
        ++k;
        printf("%d\t%.4f\t%.4f\n",k,X,Y);
    }
    return 0;
}